/*
SQLyog Ultimate v11.52 (64 bit)
MySQL - 5.5.41-log : Database - test_st
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`test_st` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `test_st`;

/*Table structure for table `st_gallery` */

DROP TABLE IF EXISTS `st_gallery`;

CREATE TABLE `st_gallery` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `src` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;

/*Data for the table `st_gallery` */

insert  into `st_gallery`(`id`,`src`) values (1,'./img/01.jpg'),(2,'./img/02.jpg'),(3,'./img/03.jpg'),(4,'./img/04.jpg'),(5,'./img/05.jpg'),(6,'./img/06.jpg'),(7,'./img/07.jpg'),(8,'./img/08.jpg'),(9,'./img/09.jpg');

/*Table structure for table `st_main` */

DROP TABLE IF EXISTS `st_main`;

CREATE TABLE `st_main` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `content` text,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

/*Data for the table `st_main` */

insert  into `st_main`(`id`,`content`) values (1,'                <p>Предлагаем выполнить небольшое тестовое задание:</p>\r\n\r\n    <p>Вот здесь есть прекрасное руководство по движку: kohanaframework. su, которое поможет Вам вникнуть в суть. Вам\r\n        предлагается создать текстовый сайт у себя дома (или на своем хостинге). Предпочтительный пакет инструментов:\r\n        Домашний веб-сервер – Denwer, Работа с SQL – Toad for MySQL, PHP – Notepad++ с плагинами для PHP, или\r\n        Dreamweaver\r\n        CS6. Но можете выбрать инструменты на свое усмотрение.\r\n    </p>\r\n\r\n    <p>САМО ЗАДАНИЕ:</p>\r\n\r\n    <p>Пусть это будет простой сайт, без особого дизайна (просто с использованием готовых стилей, например Twitter\r\n        Bootstrap). При использовании этого движка не применяйте ORM в своем проекте. Состоять он будет из трех\r\n        разделов:\r\n        Главная, Новости и Галерея. Главная – просто текст, Новости – простой список с возможностью открыть подробный\r\n        текст.\r\n        Галерея – просто ряд картинок с возможностью их увеличить. Это фронтэнд.\r\n        В качестве бэкэнда нужно будет реализовать возможность редактировать текст на главной, список новостей и\r\n        загружать\r\n        картинки в галерею. Мы не уточняем как именно все это следует реализовать, подразумевая классические модели,\r\n        которые\r\n        встречаются на большинстве сайтов рунета.\r\n        Ждем ваши работы в сопроводительной записи в откликах на вакансию или по эл. почте. Спасибо!</p>                    ');

/*Table structure for table `st_news` */

DROP TABLE IF EXISTS `st_news`;

CREATE TABLE `st_news` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL,
  `content` text,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;

/*Data for the table `st_news` */

insert  into `st_news`(`id`,`title`,`content`) values (1,'Activision сообщила о запуске бесплатной игры Call of Duty: Online','Издательство Activision Publishing сообщило сегодня об официальном запуске находившегося в разработке на протяжении нескольких лет онлайн-шутера Call of Duty: Online. Проект ориентирован на китайских геймеров, поэтому игра доступна лишь на территории Поднебесной. Если шутер в своем новом амплуа обретет популярность, подобную бизнес-модель могут применить и к другим играм.'),(2,'Microsoft, вероятно, отказалась от обновления WP 8.1 GDR2 в пользу Windows 10','По неофициальным данным, компания Microsoft откажется от выпуска очередного обновления для мобильной операционной системы Windows Phone 8.1. Вместо WP 8.1 Update 2, как ожидается, софтверная корпорация предложит релиз Windows Mobile 10 (или Windows 10 Mobile). Планируется, что в ближайшее время Microsoft откроет доступ к превью-версии мобильной ОС.'),(3,'В сеть попали тестовые снимки, полученные камерой Xiaomi Mi5','Компания Xiaomi еще не представила смартфон Mi5, до этого момента он «засветился» лишь на шпионских фотографиях. Предполагается, что аппарат получит дактилоскопический сканер, 5,5—5,7-дюймовый дисплей с разрешением 2560×1440 пикселей и защитным 2,5D-стеклом, процессор Snapdragon 805, 3 или 4 ГБ оперативной памяти и 13-мегапиксельную камеру.'),(4,'СМИ: MediaTek выпустит 12-ядерные мобильные процессоры','Компания MediaTek намерена выпустить мобильные процессоры более чем с восемью ядрами — таким образом, речь идет о 10- или даже 12-ядерных чипах. Об этом сообщает ресурс GizmoChina со ссылкой на ряд источников. Предполагается, что подобные решения появятся уже в текущем году.\r\nНасколько оправданно повышение «ядерности» мобильных процессоров, можно будет судить лишь после появления устройств с подобными чипами. Теоретически такие процессоры позволят добиться прироста производительности мобильников и снижения энергопотребления.'),(5,'Слухи: Samsung выпустит недорогие WP-смартфоны','По данным источников Korea Times, компания Samsung намерена представить в ближайшее время недорогие смартфоны под управлением операционной системы Windows Phone 8.1. Правда, существует преграда, которая не позволяет реализовать проект, пишет издание. Ранее сообщалось, что Microsoft и корейский гигант конфликтуют между собой из-за соглашения по выплате роялти.\r\nОтмечается, что Samsung отказывается выполнять свои обязательства после приобретения софтверной корпорацией мобильного подразделения Nokia. Если стороны придут к взаимовыгодному соглашению, тогда Samsung займется выпуском мобильников на мобильной платформе Microsoft, сообщил источник. Такой шаг корейская корпорация предпримет из-за слабого внимания к платформе Tizen.'),(6,'Камеры наблюдения в американской школе засняли привидение','Охранники одной из школ в американском штате Айдахо при просмотре видео с камер наблюдения обнаружили необъяснимый феномен. На кадрах можно заметить таинственную тень, передвигающуюся по коридору в направлении одного из классов. Как сообщает издание The Mirror, привидение зафиксировано в момент, когда в учебном заведении не было ни одной живой души.\r\nРанее обеспокоенный преподавательский состав уже вызывал полицию и местных охотников за привидениями. Проведенная последними экспертиза потусторонних сущностей указала на то, что на видео запечатлен реальный фантом. Также отмечается, что в прошлом в здании школы случались детские смерти, а в 1914 году ее строения были уничтожены пожаром. Школу затем отстроили заново буквально из пепла, пишет The Mirror.'),(7,'В Лиде закрылся вытрезвитель, потому что горожане стали пить меньше','Новость из Лиды: закрылся городской вытрезвитель. По словам правоохранителей, это произошло, потому что «людей в нетрезвом состоянии с неподобающим поведением в общественных местах стало меньше». Но речь действительно идет о решении проблемы алкоголизма или «клиентам» закрытого вытрезвителя придется ночевать на улице? О проблеме пишет «Лидская газета».\r\nНикуда не исчезнувшие нынешние «клиенты» закрытого вытрезвителя теперь распределяются милицией по иным местам «вспомоществования». Что это за места и по каким критериям происходит дифференциация нетрезвого контингента, рассказал Валерий Колодко, заместитель начальника отдела внутренних дел Лидского райисполкома:\r\n— При опьянениях тяжелой степени, когда речь идет о жизни человека, граждане доставляются в медицинское учреждение (реанимацию). С менее опасной формой опьянения — в наш отдел, где они находятся до полного протрезвления, далее с учетом обстоятельств и поведения задержанных решается вопрос о вынесении решения об административной или иной ответственности.\r\n— Лидский вытрезвитель закрывается не впервые. Почему? — задали журналисты вопрос заместителю начальника Лидского РОВД Леониду Прокопчику.\r\n— Криминогенная обстановка в городе улучшается, людей в нетрезвом состоянии с неподобающим поведением в общественных местах становится меньше, вот и было принято решение о закрытии специзолятора.\r\n— Его закрыли только в Лиде или такая же судьба у бывших вытрезвителей в целом по Беларуси?\r\n— Специзолятор закрыт решением Министерства внутренних дел по согласованию с местной властью только в Лиде.');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
